test/good/unbound-loop.cfg.dot
digraph "unbound-loop" {
    node [shape=box];
    subgraph "cluster_test1" {
        label="test1";
        "test1_68" [label="let a: Int = 20"];
        "test1_69" [label="while (a > 10)"];
        "test1_70" [label="return a",style=filled,fillcolor="#66A7DB"];
        "test1_68" -> "test1_69";
        "test1_69" -> "test1_69";
        "test1_69" -> "test1_70";
    }
    subgraph "cluster_test2" {
        label="test2";
        "test2_71" [label="let a: Int = 20"];
        "test2_72" [label="until (a > 10)"];
        "test2_73" [label="return a",style=filled,fillcolor="#66A7DB"];
        "test2_71" -> "test2_72";
        "test2_72" -> "test2_72";
        "test2_72" -> "test2_73";
    }
    subgraph "cluster_test3" {
        label="test3";
        "test3_74" [label="let a: Int = 20"];
        "test3_75" [label="while (a > 10)"];
        "test3_76" [label="a += 1"];
        "test3_77" [label="return a",style=filled,fillcolor="#66A7DB"];
        "test3_74" -> "test3_75";
        "test3_75" -> "test3_76";
        "test3_76" -> "test3_75";
        "test3_75" -> "test3_77";
    }
    subgraph "cluster_test4" {
        label="test4";
        "test4_78" [label="let a: Int = 10"];
        "test4_79" [label="repeat (a)"];
        "test4_80" [label="return a",style=filled,fillcolor="#66A7DB"];
        "test4_78" -> "test4_79";
        "test4_79" -> "test4_79";
        "test4_79" -> "test4_80";
    }
    subgraph "cluster_test5" {
        label="test5";
        "test5_81" [label="let i: Int = 0"];
        "test5_82" [label="while (i > 0)"];
        "test5_81" -> "test5_82";
        "test5_82" -> "test5_82";
    }
    subgraph "cluster_test6" {
        label="test6";
        "test6_83" [label="let i: Int = 0"];
        "test6_84" [label="while (10 < i)"];
        "test6_83" -> "test6_84";
        "test6_84" -> "test6_84";
    }
    subgraph "cluster_test7" {
        label="test7";
        "test7_85" [label="let i: Bool = false"];
        "test7_86" [label="while (i)"];
        "test7_85" -> "test7_86";
        "test7_86" -> "test7_86";
    }
    subgraph "cluster_test8" {
        label="test8";
        "test8_87" [label="let i: Bool = true"];
        "test8_88" [label="while (!i)"];
        "test8_87" -> "test8_88";
        "test8_88" -> "test8_88";
    }
    subgraph "cluster_fn" {
        label="fn";
    }
    subgraph "cluster_test9" {
        label="test9";
        "test9_89" [label="let a: Int = 20"];
        "test9_90" [label="while (a > 10)"];
        "test9_91" [label="fn(a)"];
        "test9_92" [label="return a",style=filled,fillcolor="#66A7DB"];
        "test9_89" -> "test9_90";
        "test9_90" -> "test9_91";
        "test9_91" -> "test9_90";
        "test9_90" -> "test9_92";
    }
    subgraph "cluster_Test__receive_internal_comment_1790_test" {
        label="Test__receive_internal_comment_1790_test";
        "Test__receive_internal_comment_1790_test_93" [label="let s: S = S{a: 1}"];
        "Test__receive_internal_comment_1790_test_94" [label="let i: Int = 0"];
        "Test__receive_internal_comment_1790_test_95" [label="while (i < s.a)"];
        "Test__receive_internal_comment_1790_test_96" [label="i += 1"];
        "Test__receive_internal_comment_1790_test_93" -> "Test__receive_internal_comment_1790_test_94";
        "Test__receive_internal_comment_1790_test_94" -> "Test__receive_internal_comment_1790_test_95";
        "Test__receive_internal_comment_1790_test_95" -> "Test__receive_internal_comment_1790_test_96";
        "Test__receive_internal_comment_1790_test_96" -> "Test__receive_internal_comment_1790_test_95";
    }
}
